WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetQName_Client_Request-5.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetQName</a:Action>
    <a:MessageID>urn:uuid:395967fb-24a5-4466-ae40-fd6bc59cc413</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetQName xmlns="http://tempuri.org/">
      <q:inQName xmlns="" xmlns:q="http://tempuri.org/">localname</q:inQName>
    </RetQName>
  </s:Body>
</s:Envelope>